pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_build_assembly_code.h
//---------------------------------------------------------------------------*
//                                                                           *
//                    File 'pic18_build_assembly_code.h'                     *
//                        Generated by version 2.5.0                         *
//                      august 1st, 2013, at 19h32'21"                       *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_build_assembly_code_ENTITIES_DEFINED
#define pic18_build_assembly_code_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_intermediate_classes.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"
#include "piccolo_embedded_devices.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*
//                                                                           *
//                    Routine 'pic18_build_assembly_code'                    *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_build_5F_assembly_5F_code (const GALGAS_string constinArgument0,
                                                       const GALGAS_registerTable constinArgument1,
                                                       const GALGAS_registerTable constinArgument2,
                                                       const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument3,
                                                       const GALGAS_actualConfigurationMap constinArgument4,
                                                       GALGAS_string & outArgument5,
                                                       C_Compiler * inCompiler
                                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction buildAssemblyCode'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                      GALGAS_stringlist & ioArgument0,
                                                                                                      GALGAS_uint & ioArgument1,
                                                                                                      C_Compiler * inCompiler
                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildAssemblyCode (const PMSInt32 inClassIndex,
                                            categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_buildAssemblyCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildAssemblyCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                           GALGAS_stringlist & io_ioStringList,
                                           GALGAS_uint & io_ioBccLabelIndex,
                                           C_Compiler * inCompiler
                                           COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
